
bomb:     file format elf64-x86-64


Disassembly of section .interp:

0000000000400238 <.interp>:
  400238:	2f                   	(bad)  
  400239:	6c                   	insb   (%dx),%es:(%rdi)
  40023a:	69 62 36 34 2f 6c 64 	imul   $0x646c2f34,0x36(%rdx),%esp
  400241:	2d 6c 69 6e 75       	sub    $0x756e696c,%eax
  400246:	78 2d                	js     400275 <_init-0x80b>
  400248:	78 38                	js     400282 <_init-0x7fe>
  40024a:	36 2d 36 34 2e 73    	ss sub $0x732e3436,%eax
  400250:	6f                   	outsl  %ds:(%rsi),(%dx)
  400251:	2e 32 00             	xor    %cs:(%rax),%al

Disassembly of section .note.ABI-tag:

0000000000400254 <.note.ABI-tag>:
  400254:	04 00                	add    $0x0,%al
  400256:	00 00                	add    %al,(%rax)
  400258:	10 00                	adc    %al,(%rax)
  40025a:	00 00                	add    %al,(%rax)
  40025c:	01 00                	add    %eax,(%rax)
  40025e:	00 00                	add    %al,(%rax)
  400260:	47                   	rex.RXB
  400261:	4e 55                	rex.WRX push %rbp
  400263:	00 00                	add    %al,(%rax)
  400265:	00 00                	add    %al,(%rax)
  400267:	00 02                	add    %al,(%rdx)
  400269:	00 00                	add    %al,(%rax)
  40026b:	00 06                	add    %al,(%rsi)
  40026d:	00 00                	add    %al,(%rax)
  40026f:	00 20                	add    %ah,(%rax)
  400271:	00 00                	add    %al,(%rax)
	...


  DW_CFA_advance_loc: 2 to 00000000004021d2
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r15 (r15) at cfa-16
  DW_CFA_advance_loc: 2 to 00000000004021d4
  DW_CFA_def_cfa_offset: 24
  DW_CFA_offset: r14 (r14) at cfa-24
  DW_CFA_advance_loc: 5 to 00000000004021d9
  DW_CFA_def_cfa_offset: 32
  DW_CFA_offset: r13 (r13) at cfa-32
  DW_CFA_advance_loc: 2 to 00000000004021db
  DW_CFA_def_cfa_offset: 40
  DW_CFA_offset: r12 (r12) at cfa-40
  DW_CFA_advance_loc: 8 to 00000000004021e3
  DW_CFA_def_cfa_offset: 48
  DW_CFA_offset: r6 (rbp) at cfa-48
  DW_CFA_advance_loc: 8 to 00000000004021eb
  DW_CFA_def_cfa_offset: 56
  DW_CFA_offset: r3 (rbx) at cfa-56
  DW_CFA_advance_loc: 13 to 00000000004021f8
  DW_CFA_def_cfa_offset: 64
  DW_CFA_advance_loc: 50 to 000000000040222a
  DW_CFA_def_cfa_offset: 56
  DW_CFA_advance_loc: 1 to 000000000040222b
  DW_CFA_def_cfa_offset: 48
  DW_CFA_advance_loc: 1 to 000000000040222c
  DW_CFA_def_cfa_offset: 40
  DW_CFA_advance_loc: 2 to 000000000040222e
  DW_CFA_def_cfa_offset: 32
  DW_CFA_advance_loc: 2 to 0000000000402230
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 2 to 0000000000402232
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 2 to 0000000000402234
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop

00000488 0000000000000014 0000045c FDE cie=00000030 pc=0000000000402240..0000000000402242
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000004a0 ZERO terminator


Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000400d56 0000000000000137 
    0000000000000000 0000000000000000 

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x891 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x15b): GNU C11 5.4.0 20160609 -mtune=generic -march=x86-64 -ggdb -O1 -fstack-protector-strong
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x23a): bomb.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x1d4): /home/hit/hitics/lab-teacher/lab2/src
    <19>   DW_AT_low_pc      : 0x400d56
    <21>   DW_AT_high_pc     : 0x137
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x23): size_t
    <32>   DW_AT_decl_file   : 3
    <33>   DW_AT_decl_line   : 216
    <34>   DW_AT_type        : <0x38>
 <1><38>: Abbrev Number: 3 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 7	(unsigned)
    <3b>   DW_AT_name        : (indirect string, offset: 0x46): long unsigned int
 <1><3f>: Abbrev Number: 3 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 1
    <41>   DW_AT_encoding    : 8	(unsigned char)
    <42>   DW_AT_name        : (indirect string, offset: 0x20e): unsigned char
 <1><46>: Abbrev Number: 3 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 2
    <48>   DW_AT_encoding    : 7	(unsigned)
    <49>   DW_AT_name        : (indirect string, offset: 0x107): short unsigned int
 <1><4d>: Abbrev Number: 3 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 4
    <4f>   DW_AT_encoding    : 7	(unsigned)
    <50>   DW_AT_name        : (indirect string, offset: 0x4b): unsigned int
 <1><54>: Abbrev Number: 3 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 1
    <56>   DW_AT_encoding    : 6	(signed char)
    <57>   DW_AT_name        : (indirect string, offset: 0x210): signed char
 <1><5b>: Abbrev Number: 3 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2
    <5d>   DW_AT_encoding    : 5	(signed)
    <5e>   DW_AT_name        : (indirect string, offset: 0x21c): short int
 <1><62>: Abbrev Number: 4 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : int
 <1><69>: Abbrev Number: 3 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 8
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0x67): long int
 <1><70>: Abbrev Number: 2 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x7): __off_t
    <75>   DW_AT_decl_file   : 4
    <76>   DW_AT_decl_line   : 131
    <77>   DW_AT_type        : <0x69>
 <1><7b>: Abbrev Number: 2 (DW_TAG_typedef)
    <7c>   DW_AT_name        : (indirect string, offset: 0x24d): __off64_t
    <80>   DW_AT_decl_file   : 4
    <81>   DW_AT_decl_line   : 132
    <82>   DW_AT_type        : <0x69>
 <1><86>: Abbrev Number: 3 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 8
    <88>   DW_AT_encoding    : 7	(unsigned)
    <89>   DW_AT_name        : (indirect string, offset: 0x152): sizetype
 <1><8d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8e>   DW_AT_byte_size   : 8
 <1><8f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <90>   DW_AT_byte_size   : 8
    <91>   DW_AT_type        : <0x95>
 <1><95>: Abbrev Number: 3 (DW_TAG_base_type)
    <96>   DW_AT_byte_size   : 1
    <97>   DW_AT_encoding    : 6	(signed char)
    <98>   DW_AT_name        : (indirect string, offset: 0x217): char
 <1><9c>: Abbrev Number: 2 (DW_TAG_typedef)
    <9d>   DW_AT_name        : (indirect string, offset: 0x1cf): FILE
    <a1>   DW_AT_decl_file   : 5
    <a2>   DW_AT_decl_line   : 48
    <a3>   DW_AT_type        : <0xa7>
 <1><a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <a8>   DW_AT_name        : (indirect string, offset: 0x1cb): _IO_FILE
    <ac>   DW_AT_byte_size   : 216
    <ad>   DW_AT_decl_file   : 6
    <ae>   DW_AT_decl_line   : 241
    <af>   DW_AT_sibling     : <0x224>
 <2><b3>: Abbrev Number: 8 (DW_TAG_member)
    <b4>   DW_AT_name        : (indirect string, offset: 0x93): _flags
    <b8>   DW_AT_decl_file   : 6
    <b9>   DW_AT_decl_line   : 242
    <ba>   DW_AT_type        : <0x62>
    <be>   DW_AT_data_member_location: 0
 <2><bf>: Abbrev Number: 8 (DW_TAG_member)
    <c0>   DW_AT_name        : (indirect string, offset: 0xf): _IO_read_ptr
    <c4>   DW_AT_decl_file   : 6
    <c5>   DW_AT_decl_line   : 247
    <c6>   DW_AT_type        : <0x8f>
    <ca>   DW_AT_data_member_location: 8
 <2><cb>: Abbrev Number: 8 (DW_TAG_member)
    <cc>   DW_AT_name        : (indirect string, offset: 0x86): _IO_read_end
    <d0>   DW_AT_decl_file   : 6
    <d1>   DW_AT_decl_line   : 248
    <d2>   DW_AT_type        : <0x8f>
    <d6>   DW_AT_data_member_location: 16
 <2><d7>: Abbrev Number: 8 (DW_TAG_member)
    <d8>   DW_AT_name        : (indirect string, offset: 0x257): _IO_read_base
    <dc>   DW_AT_decl_file   : 6
    <dd>   DW_AT_decl_line   : 249
    <de>   DW_AT_type        : <0x8f>
    <e2>   DW_AT_data_member_location: 24
 <2><e3>: Abbrev Number: 8 (DW_TAG_member)
    <e4>   DW_AT_name        : (indirect string, offset: 0x2f3): _IO_write_base
    <e8>   DW_AT_decl_file   : 6
    <e9>   DW_AT_decl_line   : 250
    <ea>   DW_AT_type        : <0x8f>
    <ee>   DW_AT_data_member_location: 32
 <2><ef>: Abbrev Number: 8 (DW_TAG_member)
    <f0>   DW_AT_name        : (indirect string, offset: 0xf3): _IO_write_ptr
    <f4>   DW_AT_decl_file   : 6
    <f5>   DW_AT_decl_line   : 251
    <f6>   DW_AT_type        : <0x8f>
    <fa>   DW_AT_data_member_location: 40
 <2><fb>: Abbrev Number: 8 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x1b2): _IO_write_end
    <100>   DW_AT_decl_file   : 6
    <101>   DW_AT_decl_line   : 252
    <102>   DW_AT_type        : <0x8f>
    <106>   DW_AT_data_member_location: 48
 <2><107>: Abbrev Number: 8 (DW_TAG_member)
    <108>   DW_AT_name        : (indirect string, offset: 0x34): _IO_buf_base
    <10c>   DW_AT_decl_file   : 6
    <10d>   DW_AT_decl_line   : 253
    <10e>   DW_AT_type        : <0x8f>
    <112>   DW_AT_data_member_location: 56
 <2><113>: Abbrev Number: 8 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x9a): _IO_buf_end
    <118>   DW_AT_decl_file   : 6
    <119>   DW_AT_decl_line   : 254
    <11a>   DW_AT_type        : <0x8f>
    <11e>   DW_AT_data_member_location: 64
 <2><11f>: Abbrev Number: 9 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x11a): _IO_save_base
    <124>   DW_AT_decl_file   : 6
    <125>   DW_AT_decl_line   : 256
    <127>   DW_AT_type        : <0x8f>
    <12b>   DW_AT_data_member_location: 72
 <2><12c>: Abbrev Number: 9 (DW_TAG_member)
    <12d>   DW_AT_name        : (indirect string, offset: 0x2d9): _IO_backup_base
    <131>   DW_AT_decl_file   : 6
    <132>   DW_AT_decl_line   : 257
    <134>   DW_AT_type        : <0x8f>
    <138>   DW_AT_data_member_location: 80
 <2><139>: Abbrev Number: 9 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0x265): _IO_save_end
    <13e>   DW_AT_decl_file   : 6
    <13f>   DW_AT_decl_line   : 258
    <141>   DW_AT_type        : <0x8f>
    <145>   DW_AT_data_member_location: 88
 <2><146>: Abbrev Number: 9 (DW_TAG_member)
    <147>   DW_AT_name        : (indirect string, offset: 0x205): _markers
    <14b>   DW_AT_decl_file   : 6
    <14c>   DW_AT_decl_line   : 260
    <14e>   DW_AT_type        : <0x25c>
    <152>   DW_AT_data_member_location: 96
 <2><153>: Abbrev Number: 9 (DW_TAG_member)
    <154>   DW_AT_name        : (indirect string, offset: 0x1c): _chain
    <158>   DW_AT_decl_file   : 6
    <159>   DW_AT_decl_line   : 262
    <15b>   DW_AT_type        : <0x262>
    <15f>   DW_AT_data_member_location: 104
 <2><160>: Abbrev Number: 9 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x7e): _fileno
    <165>   DW_AT_decl_file   : 6
    <166>   DW_AT_decl_line   : 264
    <168>   DW_AT_type        : <0x62>
    <16c>   DW_AT_data_member_location: 112
 <2><16d>: Abbrev Number: 9 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x12e): _flags2
    <172>   DW_AT_decl_file   : 6
    <173>   DW_AT_decl_line   : 268
    <175>   DW_AT_type        : <0x62>
    <179>   DW_AT_data_member_location: 116
 <2><17a>: Abbrev Number: 9 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0xbf): _old_offset
    <17f>   DW_AT_decl_file   : 6
    <180>   DW_AT_decl_line   : 270
    <182>   DW_AT_type        : <0x70>
    <186>   DW_AT_data_member_location: 120
 <2><187>: Abbrev Number: 9 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xa6): _cur_column
    <18c>   DW_AT_decl_file   : 6
    <18d>   DW_AT_decl_line   : 274
    <18f>   DW_AT_type        : <0x46>
    <193>   DW_AT_data_member_location: 128
 <2><194>: Abbrev Number: 9 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x226): _vtable_offset
    <199>   DW_AT_decl_file   : 6
    <19a>   DW_AT_decl_line   : 275
    <19c>   DW_AT_type        : <0x54>
    <1a0>   DW_AT_data_member_location: 130
 <2><1a1>: Abbrev Number: 9 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x2a): _shortbuf
    <1a6>   DW_AT_decl_file   : 6
    <1a7>   DW_AT_decl_line   : 276
    <1a9>   DW_AT_type        : <0x268>
    <1ad>   DW_AT_data_member_location: 131
 <2><1ae>: Abbrev Number: 9 (DW_TAG_member)
    <1af>   DW_AT_name        : (indirect string, offset: 0x128): _lock
    <1b3>   DW_AT_decl_file   : 6
    <1b4>   DW_AT_decl_line   : 280
    <1b6>   DW_AT_type        : <0x278>
    <1ba>   DW_AT_data_member_location: 136
 <2><1bb>: Abbrev Number: 9 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xc3): _offset
    <1c0>   DW_AT_decl_file   : 6
    <1c1>   DW_AT_decl_line   : 289
    <1c3>   DW_AT_type        : <0x7b>
    <1c7>   DW_AT_data_member_location: 144
 <2><1c8>: Abbrev Number: 9 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x278): __pad1
    <1cd>   DW_AT_decl_file   : 6
    <1ce>   DW_AT_decl_line   : 297
    <1d0>   DW_AT_type        : <0x8d>
    <1d4>   DW_AT_data_member_location: 152
 <2><1d5>: Abbrev Number: 9 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x27f): __pad2
    <1da>   DW_AT_decl_file   : 6
    <1db>   DW_AT_decl_line   : 298
    <1dd>   DW_AT_type        : <0x8d>
    <1e1>   DW_AT_data_member_location: 160
 <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x286): __pad3
    <1e7>   DW_AT_decl_file   : 6
    <1e8>   DW_AT_decl_line   : 299
    <1ea>   DW_AT_type        : <0x8d>
    <1ee>   DW_AT_data_member_location: 168
 <2><1ef>: Abbrev Number: 9 (DW_TAG_member)
    <1f0>   DW_AT_name        : (indirect string, offset: 0x28d): __pad4
    <1f4>   DW_AT_decl_file   : 6
    <1f5>   DW_AT_decl_line   : 300
    <1f7>   DW_AT_type        : <0x8d>
    <1fb>   DW_AT_data_member_location: 176
 <2><1fc>: Abbrev Number: 9 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0x294): __pad5
    <201>   DW_AT_decl_file   : 6
    <202>   DW_AT_decl_line   : 302
    <204>   DW_AT_type        : <0x2d>
    <208>   DW_AT_data_member_location: 184
 <2><209>: Abbrev Number: 9 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x136): _mode
    <20e>   DW_AT_decl_file   : 6
    <20f>   DW_AT_decl_line   : 303
    <211>   DW_AT_type        : <0x62>
    <215>   DW_AT_data_member_location: 192
 <2><216>: Abbrev Number: 9 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0x29b): _unused2
    <21b>   DW_AT_decl_file   : 6
    <21c>   DW_AT_decl_line   : 305
    <21e>   DW_AT_type        : <0x27e>
    <222>   DW_AT_data_member_location: 196
 <2><223>: Abbrev Number: 0
 <1><224>: Abbrev Number: 10 (DW_TAG_typedef)
    <225>   DW_AT_name        : (indirect string, offset: 0x1c0): _IO_lock_t
    <229>   DW_AT_decl_file   : 6
    <22a>   DW_AT_decl_line   : 150
 <1><22b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <22c>   DW_AT_name        : (indirect string, offset: 0xe2): _IO_marker
    <230>   DW_AT_byte_size   : 24
    <231>   DW_AT_decl_file   : 6
    <232>   DW_AT_decl_line   : 156
    <233>   DW_AT_sibling     : <0x25c>
 <2><237>: Abbrev Number: 8 (DW_TAG_member)
    <238>   DW_AT_name        : (indirect string, offset: 0x247): _next
    <23c>   DW_AT_decl_file   : 6
    <23d>   DW_AT_decl_line   : 157
    <23e>   DW_AT_type        : <0x25c>
    <242>   DW_AT_data_member_location: 0
 <2><243>: Abbrev Number: 8 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0x101): _sbuf
    <248>   DW_AT_decl_file   : 6
    <249>   DW_AT_decl_line   : 158
    <24a>   DW_AT_type        : <0x262>
    <24e>   DW_AT_data_member_location: 8
 <2><24f>: Abbrev Number: 8 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x200): _pos
    <254>   DW_AT_decl_file   : 6
    <255>   DW_AT_decl_line   : 162
    <256>   DW_AT_type        : <0x62>
    <25a>   DW_AT_data_member_location: 16
 <2><25b>: Abbrev Number: 0
 <1><25c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <25d>   DW_AT_byte_size   : 8
    <25e>   DW_AT_type        : <0x22b>
 <1><262>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <263>   DW_AT_byte_size   : 8
    <264>   DW_AT_type        : <0xa7>
 <1><268>: Abbrev Number: 11 (DW_TAG_array_type)
    <269>   DW_AT_type        : <0x95>
    <26d>   DW_AT_sibling     : <0x278>
 <2><271>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <272>   DW_AT_type        : <0x86>
    <276>   DW_AT_upper_bound : 0
 <2><277>: Abbrev Number: 0
 <1><278>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <279>   DW_AT_byte_size   : 8
    <27a>   DW_AT_type        : <0x224>
 <1><27e>: Abbrev Number: 11 (DW_TAG_array_type)
    <27f>   DW_AT_type        : <0x95>
    <283>   DW_AT_sibling     : <0x28e>
 <2><287>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <288>   DW_AT_type        : <0x86>
    <28c>   DW_AT_upper_bound : 19
 <2><28d>: Abbrev Number: 0
 <1><28e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <28f>   DW_AT_byte_size   : 8
    <290>   DW_AT_type        : <0x294>
 <1><294>: Abbrev Number: 13 (DW_TAG_const_type)
    <295>   DW_AT_type        : <0x95>
 <1><299>: Abbrev Number: 3 (DW_TAG_base_type)
    <29a>   DW_AT_byte_size   : 8
    <29b>   DW_AT_encoding    : 5	(signed)
    <29c>   DW_AT_name        : (indirect string, offset: 0x62): long long int
 <1><2a0>: Abbrev Number: 3 (DW_TAG_base_type)
    <2a1>   DW_AT_byte_size   : 8
    <2a2>   DW_AT_encoding    : 7	(unsigned)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x41): long long unsigned int
 <1><2a7>: Abbrev Number: 14 (DW_TAG_subprogram)
    <2a8>   DW_AT_external    : 1
    <2a8>   DW_AT_name        : (indirect string, offset: 0x0): printf
    <2ac>   DW_AT_decl_file   : 2
    <2ad>   DW_AT_decl_line   : 102
    <2ae>   DW_AT_prototyped  : 1
    <2ae>   DW_AT_type        : <0x62>
    <2b2>   DW_AT_inline      : 3	(declared as inline and inlined)
    <2b3>   DW_AT_artificial  : 1
    <2b3>   DW_AT_sibling     : <0x2c4>
 <2><2b7>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x272): __fmt
    <2bc>   DW_AT_decl_file   : 2
    <2bd>   DW_AT_decl_line   : 102
    <2be>   DW_AT_type        : <0x2c4>
 <2><2c2>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <2><2c3>: Abbrev Number: 0
 <1><2c4>: Abbrev Number: 17 (DW_TAG_restrict_type)
    <2c5>   DW_AT_type        : <0x28e>
 <1><2c9>: Abbrev Number: 18 (DW_TAG_subprogram)
    <2ca>   DW_AT_external    : 1
    <2ca>   DW_AT_name        : (indirect string, offset: 0x2ee): main
    <2ce>   DW_AT_decl_file   : 1
    <2cf>   DW_AT_decl_line   : 36
    <2d0>   DW_AT_prototyped  : 1
    <2d0>   DW_AT_type        : <0x62>
    <2d4>   DW_AT_low_pc      : 0x400d56
    <2dc>   DW_AT_high_pc     : 0x137
    <2e4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2e6>   DW_AT_GNU_all_call_sites: 1
    <2e6>   DW_AT_sibling     : <0x6a6>
 <2><2ea>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x2e9): argc
    <2ef>   DW_AT_decl_file   : 1
    <2f0>   DW_AT_decl_line   : 36
    <2f1>   DW_AT_type        : <0x62>
    <2f5>   DW_AT_location    : 0x0 (location list)
 <2><2f9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x2a4): argv
    <2fe>   DW_AT_decl_file   : 1
    <2ff>   DW_AT_decl_line   : 36
    <300>   DW_AT_type        : <0x6a6>
    <304>   DW_AT_location    : 0x62 (location list)
 <2><308>: Abbrev Number: 20 (DW_TAG_variable)
    <309>   DW_AT_name        : (indirect string, offset: 0x241): input
    <30d>   DW_AT_decl_file   : 1
    <30e>   DW_AT_decl_line   : 38
    <30f>   DW_AT_type        : <0x8f>
    <313>   DW_AT_location    : 0xae (location list)
 <2><317>: Abbrev Number: 21 (DW_TAG_inlined_subroutine)
    <318>   DW_AT_abstract_origin: <0x2a7>
